Observations based on data

1)age group 15 – 25 had the highest spending rate.  This makes sense because they would have the most disposable income relative to expenses.  High school students live at home and can use allowances/part time job money towards their hobby.  Age group 20-24 is comprised with older college students who may have secured internships that give decent pay and fresh graduates who have their first “real job” so they can splurge money.  As the age groups get older, the sales go down.  This can coincide with growing obligations as people age.  It’s not suprising that the oldest group spends the least, because it can be assumed older people have older kids that require more financial obligation.

2)Sales are dominated by males.  This is not surprising, as gaming as a hobby is dominated by males.  

3)The top item choices were interesting.  I do not have the specifics for the game, so its hard to analyze why certain items would sell more than others.  In my experience, weapons in RPGs tend to give player characters the most immediate impact.  Weapon upgrades tend to be #1 priority when gearing your character in RPGs.  It’s not surprising to see weapons dominating the top 5 purchases.  It is interesting that the #1 item is a gem.  That gem must be very versatile and powerful.

In [1]:
#import dependencies
import pandas as pd

In [2]:
#make json file readers
jsonfile = pd.read_json("purchase_data.json")
jsonfile2 = pd.read_json("purchase_data2.json")

In [3]:
#make data frames with json
df1 = pd.DataFrame(jsonfile)
df2 = pd.DataFrame(jsonfile2)

In [4]:
#headers for dfs make sure they ran
df1.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [5]:
df2.head(5)

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [6]:
#merge the databases together

In [7]:
merged_df = df1.append(df2, ignore_index = True)
merged_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [8]:
#column list for reference
merged_df.columns

Index(['Age', 'Gender', 'Item ID', 'Item Name', 'Price', 'SN'], dtype='object')

In [9]:
#use len on SN value counts to find unique SNs
player_count_total = len(merged_df["SN"].value_counts())
player_count_total

612

In [10]:
#purchasing analytics(number of unique items, avg purchase price, 
#total purchases, total revenue)
num_of_unique = merged_df["Item ID"].value_counts()
num_of_unique = len(num_of_unique)
num_of_unique

184

In [11]:
#avg purchase price
avg_pp = merged_df["Price"].mean()
avg_pp

2.9305710955710955

In [12]:
#total purchases
total_purchases = merged_df["Item ID"].count()
total_purchases

858

In [13]:
#total revenue
total_revenue = merged_df["Price"].sum()
total_revenue

2514.4299999999998

In [14]:
#make a df for analytics
purchase_analytics = pd.DataFrame({
    "Total Unique Players" : [player_count_total],
     "Total Unique Items" : [num_of_unique],
     "Average Purchase Price" : [avg_pp],
     "Total Purchases" : [total_purchases],
     "Total Revenue" : [total_revenue]
})

In [15]:
#improve formatting
purchase_analytics["Average Purchase Price"] = purchase_analytics["Average Purchase Price"].map("${0:,.2f}".format)
purchase_analytics["Total Purchases"] = purchase_analytics["Total Purchases"]
purchase_analytics["Total Revenue"] = purchase_analytics["Total Revenue"].map("${0:,.2f}".format)
purchase_analytics

,Average Purchase Price,Total Purchases,Total Revenue,Total Unique Items,Total Unique Players
0,$2.93,858,"$2,514.43",184,612

In [16]:
#gender demographics(% count male, female, other/ndc)
#total members via length of unique screennames
total_members = len(merged_df["SN"].value_counts())
#make a filter for only males
male_filter = merged_df["Gender"] == "Male"
#find males
male_count = merged_df.loc[male_filter,:]
#find total unique males
male_count = len(male_count["SN"].value_counts())
#make a filter for females
female_filter = merged_df["Gender"] == "Female"
#find females
female_count = merged_df.loc[female_filter,:]
#find total unique females
female_count = len(female_count["SN"].value_counts())
other_filter = merged_df["Gender"] == "Other / Non-Disclosed"
other_count = total_members - male_count - female_count

In [17]:
#% count male
percent_male = male_count / total_members
percent_male

0.8137254901960784

In [18]:
#% count female
percent_female = female_count / total_members
percent_female

0.1830065359477124

In [19]:
#% other 
other_percent = other_count / total_members
other_percent

0.0032679738562091504

In [20]:
#make a new df with this info
data = [{"Total Members" : male_count, "Percentage of Gender" : percent_male
        },{"Total Members" : female_count , "Percentage of Gender" : percent_female
          },
        {"Total Members" : other_count , "Percentage of Gender" : other_percent}]
gender_df = pd.DataFrame(data, index = ["Male","Female","Other"])
gender_df["Percentage of Gender"] = gender_df["Percentage of Gender"] * 100
gender_df["Percentage of Gender"] = gender_df["Percentage of Gender"].map("{0:.2f}%".format)
gender_df

       Percentage of Gender  Total Members
Male                 81.37%            498
Female               18.30%            112
Other                 0.33%              2

In [21]:
#gender analytics.. find purchase count, avg pp,total value, normalized total
male_purchase_count = merged_df.loc[male_filter].count()["Item ID"]
male_purchase_count
#female purchase count
female_purchase_count = merged_df.loc[female_filter].count()["Item ID"]
female_purchase_count
#other purchase count 
other_purchase_count = total_purchases - (male_purchase_count + female_purchase_count)
other_purchase_count

12

In [22]:
#average purchase price per gender
male_avg_pp = merged_df.loc[male_filter].mean()["Price"]
male_avg_pp
#female
female_avg_pp = merged_df.loc[female_filter].mean()["Price"]
female_avg_pp
#other
other_avg_pp = merged_df.loc[other_filter].mean()["Price"]
other_avg_pp

3.1549999999999994

In [23]:
#total purchase value per gender
male_sum_purchase = merged_df.loc[male_filter].sum()["Price"]
male_sum_purchase
#female
female_sum_purchase = merged_df.loc[female_filter].sum()["Price"]
female_sum_purchase
#other
other_sum_purchase = merged_df.loc[other_filter].sum()["Price"]
other_sum_purchase

37.85999999999999

In [24]:
#normalize total per gender
male_normalized = male_sum_purchase / male_count
male_normalized
#female
female_normalized = female_sum_purchase / female_count
female_normalized
#other
other_normalized = other_sum_purchase / other_count
other_normalized

18.929999999999996

In [25]:
#make a new DF with all this info
gender_data = [{"Total Purchases" : male_purchase_count, "Average Purchase"
               : male_avg_pp, "Total Purchase Amount" : male_sum_purchase,
               "Normalized Purchase Amount" : male_normalized},
              {"Total Purchases" : female_purchase_count, "Average Purchase"
               : female_avg_pp, "Total Purchase Amount" : female_sum_purchase,
               "Normalized Purchase Amount" : female_normalized},
              {"Total Purchases" : other_purchase_count, "Average Purchase"
               : other_avg_pp, "Total Purchase Amount" : other_sum_purchase,
               "Normalized Purchase Amount" : other_normalized}]
gender_analytics_df = pd.DataFrame(gender_data, index = ["Male", "Female","Other"])
gender_analytics_df

,Average Purchase,Normalized Purchase Amount,Total Purchase Amount,Total Purchases
Male,2.944448,4.121044,2052.28,697
Female,2.847584,3.788304,424.29,149
Other,3.155000,18.930000,37.86,12

In [26]:
#format some .map("${0:,.2f}".format)
gender_analytics_df["Average Purchase"] = gender_analytics_df["Average Purchase"].map("${0:,.2f}".format)
gender_analytics_df["Normalized Purchase Amount"] = gender_analytics_df["Normalized Purchase Amount"].map("${0:,.2f}".format)
gender_analytics_df["Total Purchase Amount"] = gender_analytics_df["Total Purchase Amount"].map("${0:,.2f}".format)
gender_analytics_df

,Average Purchase,Normalized Purchase Amount,Total Purchase Amount,Total Purchases
Male,$2.94,$4.12,"$2,052.28",697
Female,$2.85,$3.79,$424.29,149
Other,$3.15,$18.93,$37.86,12

In [27]:
#age demographics, use bins per 4 years. <10,10-14,15-19,etc
age_bins = [0,10,15,20,25,30,35,40,1000]
age_labels = ["Less than 10","10 - 14","15 - 19","20 - 24","25 - 29",
             "30 - 34","35 - 39","40 and older"]
pd.cut(merged_df["Age"],age_bins,labels = age_labels )
merged_df["Age Group"] = pd.cut(merged_df["Age"],age_bins,labels = age_labels )
merged_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Group
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,35 - 39
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,20 - 24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,30 - 34
3,21,Male,92,Final Critic,1.36,Pheusrical25,20 - 24
4,23,Male,63,Stormfury Mace,1.27,Aela59,20 - 24

In [28]:
#group by object
grouped_age = merged_df.groupby("Age Group")
#total purchases by age
purchases_by_age = grouped_age["Price"].count()

In [29]:
#calculate the mean
avg_pp_by_age = grouped_age["Price"].mean()
avg_pp_by_age

Age Group
Less than 10    2.984865
10 - 14         2.882439
15 - 19         2.859951
20 - 24         2.967544
25 - 29         2.882375
30 - 34         2.995846
35 - 39         3.004286
40 and older    2.880000
Name: Price, dtype: float64

In [30]:
#sum the total values
age_total_value = grouped_age["Price"].sum()
age_total_value

Age Group
Less than 10     110.44
10 - 14          236.36
15 - 19          583.43
20 - 24         1003.03
25 - 29          230.59
30 - 34          194.73
35 - 39          147.21
40 and older       8.64
Name: Price, dtype: float64

In [31]:
#find normalized value
age_demo_total_players = grouped_age["SN"].nunique()
age_demo_total_players

Age Group
Less than 10     27
10 - 14          57
15 - 19         159
20 - 24         259
25 - 29          56
30 - 34          50
35 - 39          30
40 and older      3
Name: SN, dtype: int64

In [32]:
#find normalized values
normalized_age_value = age_total_value / age_demo_total_players
normalized_age_value

Age Group
Less than 10    4.090370
10 - 14         4.146667
15 - 19         3.669371
20 - 24         3.872703
25 - 29         4.117679
30 - 34         3.894600
35 - 39         4.907000
40 and older    2.880000
dtype: float64

In [33]:
age_demo_data = {"Total Purchases" : purchases_by_age,
                "Average Purchase by Age" : avg_pp_by_age,
                "Total Purchase Value" : age_total_value,
                "Normalized Value" : normalized_age_value}
age_demo_df = pd.DataFrame(age_demo_data)
age_demo_df

,Average Purchase by Age,Normalized Value,Total Purchase Value,Total Purchases
Age Group,,,,
Less than 10,2.984865,4.090370,110.44,37
10 - 14,2.882439,4.146667,236.36,82
15 - 19,2.859951,3.669371,583.43,204
20 - 24,2.967544,3.872703,1003.03,338
25 - 29,2.882375,4.117679,230.59,80
30 - 34,2.995846,3.894600,194.73,65
35 - 39,3.004286,4.907000,147.21,49
40 and older,2.880000,2.880000,8.64,3

In [34]:
#formatting
age_demo_df["Average Purchase by Age"] = age_demo_df["Average Purchase by Age"].map("${0:,.2f}".format)
age_demo_df["Normalized Value"] = age_demo_df["Normalized Value"].map("${0:,.2f}".format)
age_demo_df["Total Purchase Value"] = age_demo_df["Total Purchase Value"].map("${0:,.2f}".format)
age_demo_df

,Average Purchase by Age,Normalized Value,Total Purchase Value,Total Purchases
Age Group,,,,
Less than 10,$2.98,$4.09,$110.44,37
10 - 14,$2.88,$4.15,$236.36,82
15 - 19,$2.86,$3.67,$583.43,204
20 - 24,$2.97,$3.87,"$1,003.03",338
25 - 29,$2.88,$4.12,$230.59,80
30 - 34,$3.00,$3.89,$194.73,65
35 - 39,$3.00,$4.91,$147.21,49
40 and older,$2.88,$2.88,$8.64,3

In [35]:
#top 5 spenders
#group by SN
grouped_df = merged_df.groupby("SN")
#sum prices by group
grouped_df = grouped_df.sum()["Price"]
#sort, descending order
grouped_df = grouped_df.sort_values(ascending = False)
#print top 5
grouped_df.head()

SN
Undirrala66      17.06
Aerithllora36    15.10
Saedue76         13.56
Sondim43         13.02
Mindimnya67      12.74
Name: Price, dtype: float64

In [36]:
#find purchases per user
undi = merged_df["SN"] == "Undirrala66"
undi = merged_df[undi]["Item ID"].count()
aeri = merged_df["SN"] == "Aerithllora36"
aeri = merged_df[aeri]["Item ID"].count()
saed = merged_df["SN"] == "Saedue76"
saed = merged_df[saed]["Item ID"].count()
sond = merged_df["SN"] == "Sondim43"
sond = merged_df[sond]["Item ID"].count()
mind = merged_df["SN"] == "Mindimnya67"
mind = merged_df[mind]["Item ID"].count()

In [37]:
#find total values for each person
undi_total = merged_df["SN"] == "Undirrala66"
undi_total = merged_df[undi_total]["Price"].sum()
aeri_total = merged_df["SN"] == "Aerithllora36"
aeri_total = merged_df[aeri_total]["Price"].sum()
saed_total = merged_df["SN"] == "Saedue76"
saed_total = merged_df[saed_total]["Price"].sum()
sond_total = merged_df["SN"] == "Sondim43"
sond_total = merged_df[sond_total]["Price"].sum()
mind_total = merged_df["SN"] == "Mindimnya67"
mind_total = merged_df[mind_total]["Price"].sum()

In [38]:
#find averages 
undi_avg = undi_total / undi
aeri_avg = aeri_total / aeri
saed_avg = saed_total / saed
sond_avg = sond_total / sond
mind_avg = mind_total / mind

In [39]:
#make a df with all t his data
spenders_data = {"SN" : ["Undirrala66","Aerithllora36","Saedue76","Sondim43","Mindimnya67"],
                 "Total Purchases" : [undi,aeri,saed,sond,mind], "Total Purchase Amount" :
                 [undi_total,aeri_total,saed_total,sond_total,mind_total],
                 "Average Purchase" : [undi_avg,aeri_avg,saed_avg,sond_avg,mind_avg]}
top_5_users_df = pd.DataFrame(spenders_data,index = ["First","Second","Third","Fourth","Fifth"])
top_5_users_df

,Average Purchase,SN,Total Purchase Amount,Total Purchases
First,3.412,Undirrala66,17.06,5
Second,3.775,Aerithllora36,15.10,4
Third,3.390,Saedue76,13.56,4
Fourth,3.255,Sondim43,13.02,4
Fifth,3.185,Mindimnya67,12.74,4

In [40]:
#formatting
top_5_users_df["Average Purchase"] = top_5_users_df["Average Purchase"].map("${0:,.2f}".format)
top_5_users_df["Total Purchase Amount"] = top_5_users_df["Total Purchase Amount"].map("${0:,.2f}".format)
top_5_users_df

       Average Purchase             SN Total Purchase Amount  Total Purchases
First             $3.41    Undirrala66                $17.06                5
Second            $3.77  Aerithllora36                $15.10                4
Third             $3.39       Saedue76                $13.56                4
Fourth            $3.25       Sondim43                $13.02                4
Fifth             $3.18    Mindimnya67                $12.74                4

In [41]:
#top 5 popular items
popular_5 = merged_df["Item ID"].value_counts()
popular_5.head(5)

84    12
39    11
31    10
34     9
44     9
Name: Item ID, dtype: int64

In [42]:
#find data for each item
item_84 = merged_df["Item ID"] == 84
item_39 = merged_df["Item ID"] == 39
item_31 = merged_df["Item ID"] == 31
item_34 = merged_df["Item ID"] == 34
item_44 = merged_df["Item ID"] == 44
#find name for each item
item_84_name = merged_df.loc[item_84]["Item Name"].values[0]
item_39_name = merged_df.loc[item_39]["Item Name"].values[0]
item_31_name = merged_df.loc[item_31]["Item Name"].values[0]
item_34_name = merged_df.loc[item_34]["Item Name"].values[0]
item_44_name = merged_df.loc[item_44]["Item Name"].values[0]

In [43]:
#find the amounts each item was purchased
item_84_purchase = len(merged_df.loc[item_84])
item_39_purchase = len(merged_df.loc[item_39])
item_31_purchase = len(merged_df.loc[item_31])
item_34_purchase = len(merged_df.loc[item_34])
item_44_purchase = len(merged_df.loc[item_44])

In [44]:
#find item price
item_84_price = merged_df.loc[item_84]["Price"].values[0]
item_39_price = merged_df.loc[item_39]["Price"].values[0]
item_31_price = merged_df.loc[item_31]["Price"].values[0]
item_34_price = merged_df.loc[item_34]["Price"].values[0]
item_44_price = merged_df.loc[item_44]["Price"].values[0]

In [45]:
#find total purchase value
item_84_value = merged_df.loc[item_84]["Price"].sum()
item_39_value = merged_df.loc[item_39]["Price"].sum()
item_31_value = merged_df.loc[item_31]["Price"].sum()
item_34_value = merged_df.loc[item_34]["Price"].sum()
item_44_value = merged_df.loc[item_44]["Price"].sum()

In [46]:
#final index
top_5_items_data = {"Item Name" : [item_84_name,item_39_name,item_31_name,item_34_name,item_44_name],
                   "Total Purchases" : [item_84_purchase,item_39_purchase,item_31_purchase,item_34_purchase,item_44_purchase],
                   "Item Price" : [item_84_price,item_39_price,item_31_price,item_34_price,item_44_price],
                   "Total Revenue" : [item_84_value,item_39_value,item_31_value,item_34_value,item_44_value]}
top_5_items_df = pd.DataFrame(top_5_items_data,index = ["First","Second","Third","Fourth","Fifth"])
top_5_items_df

,Item Name,Item Price,Total Purchases,Total Revenue
First,Arcane Gem,2.23,12,29.34
Second,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
Third,Trickster,2.07,10,23.22
Fourth,Retribution Axe,4.14,9,37.26
Fifth,Bonecarvin Battle Axe,2.46,9,24.04

In [47]:
#formatting
top_5_items_df["Item Price"] = top_5_items_df["Item Price"].map("${0:,.2f}".format)
top_5_items_df["Total Revenue"] = top_5_items_df["Total Revenue"].map("${0:,.2f}".format)
top_5_items_df

,Item Name,Item Price,Total Purchases,Total Revenue
First,Arcane Gem,$2.23,12,$29.34
Second,"Betrayal, Whisper of Grieving Widows",$2.35,11,$25.85
Third,Trickster,$2.07,10,$23.22
Fourth,Retribution Axe,$4.14,9,$37.26
Fifth,Bonecarvin Battle Axe,$2.46,9,$24.04

In [48]:
#top 5 profitable items
#group them by item id
grouped_df = merged_df.groupby("Item ID")
#sum the revenue
grouped_df = grouped_df["Price"].sum()
#descending order
grouped_df = grouped_df.sort_values(ascending = False)
#top 5
grouped_df.head(5)

Item ID
34     37.26
107    33.03
115    29.75
32     29.70
84     29.34
Name: Price, dtype: float64

In [49]:
#find data for each item
item_34 = merged_df["Item ID"] == 34
item_107 = merged_df["Item ID"] == 107
item_115 = merged_df["Item ID"] == 115
item_32 = merged_df["Item ID"] == 32
item_84 = merged_df["Item ID"] == 84
#find name for each item
item_34_name = merged_df.loc[item_34]["Item Name"].values[0]
item_107_name = merged_df.loc[item_107]["Item Name"].values[0]
item_115_name = merged_df.loc[item_115]["Item Name"].values[0]
item_32_name = merged_df.loc[item_32]["Item Name"].values[0]
item_84_name = merged_df.loc[item_84]["Item Name"].values[0]

In [50]:
#find the amounts each item was purchased
item_34_purchase = len(merged_df.loc[item_34])
item_107_purchase = len(merged_df.loc[item_107])
item_115_purchase = len(merged_df.loc[item_115])
item_32_purchase = len(merged_df.loc[item_32])
item_84_purchase = len(merged_df.loc[item_84])

In [51]:
#find item price
item_34_price = merged_df.loc[item_34]["Price"].values[0]
item_107_price = merged_df.loc[item_107]["Price"].values[0]
item_115_price = merged_df.loc[item_115]["Price"].values[0]
item_32_price = merged_df.loc[item_32]["Price"].values[0]
item_84_price = merged_df.loc[item_84]["Price"].values[0]

In [52]:
#find total purchase value
item_34_value = merged_df.loc[item_34]["Price"].sum()
item_107_value = merged_df.loc[item_107]["Price"].sum()
item_115_value = merged_df.loc[item_115]["Price"].sum()
item_32_value = merged_df.loc[item_32]["Price"].sum()
item_84_value = merged_df.loc[item_84]["Price"].sum()

In [53]:
#get final table
top_5_profit_data = {"Item Name" : [item_34_name,item_107_name,item_115_name,item_32_name,item_84_name],
                   "Total Purchases" : [item_34_purchase,item_107_purchase,item_115_purchase,item_32_purchase,item_84_purchase],
                   "Item Price" : [item_34_price,item_107_price,item_115_price,item_32_price,item_84_price],
                   "Total Revenue" : [item_34_value,item_107_value,item_115_value,item_32_value,item_84_value]}
top_5_profit_df = pd.DataFrame(top_5_profit_data,index = ["First","Second","Third","Fourth","Fifth"])
top_5_profit_df

                         Item Name  Item Price  Total Purchases  Total Revenue
First              Retribution Axe        4.14                9          37.26
Second   Splitter, Foe Of Subtlety        3.61                9          33.03
Third   Spectral Diamond Doomblade        4.25                7          29.75
Fourth                     Orenmir        4.95                6          29.70
Fifth                   Arcane Gem        2.23               12          29.34

In [54]:
# #formatting
top_5_profit_df["Item Price"] = top_5_profit_df["Item Price"].map("${0:,.2f}".format)
top_5_profit_df["Total Revenue"] = top_5_profit_df["Total Revenue"].map("${0:,.2f}".format)
top_5_profit_df

                         Item Name Item Price  Total Purchases Total Revenue
First              Retribution Axe      $4.14                9        $37.26
Second   Splitter, Foe Of Subtlety      $3.61                9        $33.03
Third   Spectral Diamond Doomblade      $4.25                7        $29.75
Fourth                     Orenmir      $4.95                6        $29.70
Fifth                   Arcane Gem      $2.23               12        $29.34

In [55]:
#Finish!